importing necessary libraries

In [0]:
%matplotlib inline
%config InlineBackend.figure_format = 'retina'

import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

import torch
from torch import nn
from torch import optim
import torch.nn.functional as F
from torchvision import datasets, transforms, models

In [20]:
train.head()

   ISO_Week  Winter  Spring  Summer  Autumn  SKU_A  SKU_B  SKU_C
0         4       1       0       0       0      1      0      0
1         5       1       0       0       0      1      0      0
2         6       1       0       0       0      1      0      0
3         7       1       0       0       0      1      0      0
4         9       0       1       0       0      1      0      0

In [37]:
train=pd.read_excel('train.xlsx')
train.head()
train.count()

SKU         82
ISO_Week    82
Sales       82
Season      82
Winter      82
Spring      82
Summer      82
Autumn      82
SKU_A       82
SKU_B       82
SKU_C       82
dtype: int64

In [0]:
train=train.drop("Sales",axis=1)

In [0]:
train_label=pd.DataFrame()
train_label['Sales']=train['Sales'].values

In [10]:
train_label.head()

   Sales
0   6988
1   6743
2   4112
3   5732
4   5559

In [77]:
test=pd.read_excel('test.xlsx')
test.head()

        SKU  ISO_Week  Sales  Season  ...  Autumn  SKU_A  SKU_B  SKU_C
0  ProductA        42   4740  AUTUMN  ...       1      1      0      0
1  ProductA        43   4341  AUTUMN  ...       1      1      0      0
2  ProductA        44   5363  AUTUMN  ...       1      1      0      0
3  ProductA        45  12120  AUTUMN  ...       1      1      0      0
4  ProductA        46   3314  AUTUMN  ...       1      1      0      0

[5 rows x 11 columns]

In [0]:
for x in ['SKU','Season']:
  test=test.drop(x,axis=1)

In [0]:
test_label=pd.DataFrame()
test_label['Sales']=test['Sales'].values

In [82]:
test.head()

   ISO_Week  Winter  Spring  Summer  Autumn  SKU_A  SKU_B  SKU_C
0        42       0       0       0       1      1      0      0
1        43       0       0       0       1      1      0      0
2        44       0       0       0       1      1      0      0
3        45       0       0       0       1      1      0      0
4        46       0       0       0       1      1      0      0

In [0]:
test=test.drop('Sales',axis=1)

In [83]:
test.count()

ISO_Week    33
Winter      33
Spring      33
Summer      33
Autumn      33
SKU_A       33
SKU_B       33
SKU_C       33
dtype: int64

In [84]:
test_label.head()

   Sales
0   4740
1   4341
2   5363
3  12120
4   3314

In [0]:
test=test.drop('Sales', axis=1)

In [0]:
model=nn.Sequential(nn.Linear(8,4),nn.ReLU(),nn.Linear(4,1))

In [0]:
train_input=train.values
train_target=train_label.values

In [0]:
train_input=torch.from_numpy(train_input)
train_target=torch.from_numpy(train_target)

In [0]:
train_input=train_input.float()
train_target=train_target.float()

In [0]:
criterion=nn.MSELoss()
optimizer=optim.Adam(model.parameters(),lr=0.1)

In [0]:
dataset=[(train_input,train_target)]

In [0]:
for i in range(1000):
  for inputs,labels in dataset:
    
    optimizer.zero_grad()
    output=model(inputs)
    loss=criterion(output,labels)
    loss.backward()
    optimizer.step()

In [66]:
loss.item()/82

325776.48780487804

In [0]:
test_input=torch.from_numpy(test.values).float()

In [0]:
result=model(test_input)

In [87]:
result

tensor([[4310.3438],
        [4356.8315],
        [4403.3193],
        [4449.8076],
        [4496.2949],
        [4542.7832],
        [4589.2710],
        [7965.5527],
        [8012.0410],
        [8058.5283],
        [8105.0161],
        [  12.2205],
        [  12.2205],
        [  12.2205],
        [  12.2205],
        [  12.2205],
        [  12.2205],
        [  12.2205],
        [ 910.2929],
        [ 939.3646],
        [ 968.4360],
        [ 997.5076],
        [7505.3213],
        [7551.8096],
        [7598.2969],
        [7644.7852],
        [7691.2729],
        [7737.7612],
        [7784.2480],
        [9704.6934],
        [9751.1816],
        [9797.6699],
        [9844.1572]], grad_fn=<AddmmBackward>)

In [0]:
result_output=result.detach().numpy()

In [89]:
result_df=pd.DataFrame(result_output)
result_df.head()

             0
0  4310.343750
1  4356.831543
2  4403.319336
3  4449.807617
4  4496.294922

In [0]:
result_df.to_excel("output.xlsx")